Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.0.33/saml21b/edc/ATSAML21G18B.PIC
      <edc:AdjustPoint edc:_addr="0x40000C39" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x40000C3C" edc:access="------rr" edc:cname="DPLLSTATUS" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="LOCK" edc:desc="DPLL Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKRDY" edc:desc="DPLL Clock Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000C3D" edc:offset="0x3C3"/>
      <edc:SFRDef edc:_addr="0x40001000" edc:access="------------------------------nn" edc:cname="INTENCLR" edc:impl="0x3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:desc="XOSC32K Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KRDY" edc:desc="OSC32K Ready Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001004" edc:access="------------------------------nn" edc:cname="INTENSET" edc:impl="0x3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:desc="XOSC32K Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KRDY" edc:desc="OSC32K Ready Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001008" edc:access="------------------------------nn" edc:cname="INTFLAG" edc:impl="0x3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:desc="XOSC32K Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KRDY" edc:desc="OSC32K Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000100C" edc:access="------------------------------rr" edc:cname="STATUS" edc:impl="0x3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:desc="XOSC32K Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KRDY" edc:desc="OSC32K Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001010" edc:access="-----------------------------nnn" edc:cname="RTCCTRL" edc:impl="0x7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="RTCSEL" edc:desc="RTC Clock Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="ULP1K" edc:desc="1.024kHz from 32kHz internal ULP oscillator" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ULP32K" edc:desc="32.768kHz from 32kHz internal ULP oscillator" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="OSC1K" edc:desc="1.024kHz from 32.768kHz internal oscillator" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="OSC32K" edc:desc="32.768kHz from 32.768kHz internal oscillator" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="XOSC1K" edc:desc="1.024kHz from 32.768kHz internal oscillator" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="32.768kHz from 32.768kHz external crystal oscillator" edc:when="(field &amp; 0x7) == 5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001014" edc:access="-------------------n-nnnnn-nnnn-" edc:cname="XOSC32K" edc:impl="0x17DE" edc:mclr="00000000000000000000000010000000" edc:nzwidth="0x20" edc:por="00000000000000000000000010000000" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Oscillator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XTALEN" edc:desc="Crystal Oscillator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN32K" edc:desc="32kHz Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN1K" edc:desc="1kHz Output Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="On Demand Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STARTUP" edc:desc="Oscillator Start-Up Time" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CYCLE1" edc:desc="0.122 ms" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE32" edc:desc="1.068 ms" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE2048" edc:desc="62.6 ms" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE4096" edc:desc="125 ms" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE16384" edc:desc="500 ms" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE32768" edc:desc="1000 ms" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE65536" edc:desc="2000 ms" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE131072" edc:desc="4000 ms" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:desc="Write Lock" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001018" edc:access="---------nnnnnnn---n-nnnnn--nnn-" edc:cname="OSC32K" edc:impl="0x7F17CE" edc:mclr="00000000001111110000000010000000" edc:nzwidth="0x20" edc:por="00000000001111110000000010000000" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Oscillator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN32K" edc:desc="32kHz Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN1K" edc:desc="1kHz Output Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="On Demand Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STARTUP" edc:desc="Oscillator Start-Up Time" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CYCLE3" edc:desc="0.092 ms" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE4" edc:desc="0.122 ms" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE6" edc:desc="0.183 ms" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE10" edc:desc="0.305 ms" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE18" edc:desc="0.549 ms" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE34" edc:desc="1.038 ms" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE66" edc:desc="2.014 ms" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE130" edc:desc="3.967 ms" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:desc="Write Lock" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CALIB" edc:desc="Oscillator Calibration" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000101C" edc:access="----------------n--nnnnn--------" edc:cname="OSCULP32K" edc:impl="0x9F00" edc:nzwidth="0x20" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="CALIB" edc:desc="Oscillator Calibration" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:desc="Write Lock" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
