Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.0.33/saml21b/edc/ATSAML21G18B.PIC
      <edc:SFRDef edc:_addr="0x4100400C" edc:access="------nn" edc:cname="INTENCLR" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="READY" edc:desc="NVM Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Error Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100400D" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x41004010" edc:access="------nn" edc:cname="INTENSET" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="READY" edc:desc="NVM Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Error Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41004011" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x41004014" edc:access="------nn" edc:cname="INTFLAG" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="READY" edc:desc="NVM Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41004015" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x41004018" edc:access="-------n---nnnnn" edc:cname="STATUS" edc:impl="0x11F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="PRM" edc:desc="Power Reduction Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOAD" edc:desc="NVM Page Buffer Active Loading" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PROGE" edc:desc="Programming Error Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKE" edc:desc="Lock Error Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVME" edc:desc="NVM Error" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SB" edc:desc="Security Bit Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100401A" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x4100401C" edc:access="----------nnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADDR" edc:impl="0x3FFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="NVM Address" edc:nzwidth="0x16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004020" edc:access="nnnnnnnnnnnnnnnn" edc:cname="LOCK" edc:nzwidth="0x10" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="LOCK" edc:desc="Region Lock Bits" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41004022" edc:offset="0x1FDE"/>
      <edc:SFRDef edc:_addr="0x41006000" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="POSITION" edc:impl="0xFFFFFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="MTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MTB">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WRAP" edc:desc="Pointer Value Wraps" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POINTER" edc:desc="Trace Packet Location Pointer" edc:nzwidth="0x1D"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006004" edc:access="n---------------------nnnnnnnnnn" edc:cname="MASTER" edc:impl="0x800003FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MTB">
            <edc:SFRFieldDef edc:cname="MASK" edc:desc="Maximum Value of the Trace Buffer in SRAM" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="TSTARTEN" edc:desc="Trace Start Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSTOPEN" edc:desc="Trace Stop Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFRWPRIV" edc:desc="Special Function Register Write Privilege" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RAMPRIV" edc:desc="SRAM Privilege" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HALTREQ" edc:desc="Halt Request" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x15"/>
            <edc:SFRFieldDef edc:cname="EN" edc:desc="Main Trace Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006008" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnn-nn" edc:cname="FLOW" edc:impl="0xFFFFFFFB" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MTB">
            <edc:SFRFieldDef edc:cname="AUTOSTOP" edc:desc="Auto Stop Tracing" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AUTOHALT" edc:desc="Auto Halt Request" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WATERMARK" edc:desc="Watermark value" edc:nzwidth="0x1D"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
